INSERT INTO td_data_month_master(id,monday_solar_num,tuesday_solar_num,wednesday_solar_num,thursday_solar_num,friday_solar_num,saturday_solar_num,sunday_solar_num
,monday_midpright_co,tuesday_midpright_co,wednesday_midpright_co,thursday_midpright_co,friday_midpright_co,saturday_midpright_co,sunday_midpright_co
,monday_top_url,tuesday_top_url,wednesday_top_url,thursday_top_url,friday_top_url,saturday_top_url,sunday_top_url
,monday_topright_co,tuesday_topright_co,wednesday_topright_co,thursday_topright_co,friday_topright_co,saturday_topright_co,sunday_topright_co
,monday_underpright_co,tuesday_underpright_co,wednesday_underpright_co,thursday_underpright_co,friday_underpright_co,saturday_underpright_co,sunday_underpright_co
,month,num_month,year,year_en,year_lunar,year_buddha_era,holiday1,holiday2,holiday3,holiday4,holiday5
) VALUES
(
    /*01 Jan*/
1,'','1','2','3','4','5','6'
,'','10 រោច','១១ រោចខែមិគសិរ','១២ រោច','១៣ រោច ថ្ងៃកោរ','១៤ រោចខែដាច់','១ កើត ខែបុស្ស'
,'','','','','','url',''
,'','','','','','',''
,'','ចូលឆ្នាំសកល','','','','',''
,'មករា','01','២០១៩','2019','ច','២៥៦២','០១- ចូលឆ្នាំសកល / International News Year Day','០៧- ទិវាជ័យជំនះលើរបបប្រល័យពូជសាសន៌ / Victory Day Over The Genocidal Regime','','',''
),
  (
    2,'7','8','9','10','11','12','13'
    ,'២ កើត','៣ កើត','៤ កើត','៥ កើត','៦ កើត','៧ កើត','៨ កើត ថ្ងៃសិល'
    ,'','','','','','','url'
    ,'','','','','','',''
    ,'ទិវាជ័យជំនះ','','','','','',''
    ,'មករា','01','២០១៩','2019','ច','២៥៦២','០១- ចូលឆ្នាំសកល / International News Year Day','០៧- ទិវាជ័យជំនះលើរបបប្រល័យពូជសាសន៌ / Victory Day Over The Genocidal Regime','','',''
  ),
  (
    3,'14','15','16','17','18','19','20'
    ,'៩ កើត','១០ កើត','១១ កើត','១២ កើត','១៣ កើត','១៤ កើត','១៥ កើត ថ្ងៃសិល'
    ,'','','','','','','url'
    ,'','','','','','','ពេញបូរណ័មី'
    ,'ទិវាជ័យជំនះ','','','','','',''
    ,'មករា','01','២០១៩','2019','ច','២៥៦២','០១- ចូលឆ្នាំសកល / International News Year Day','០៧- ទិវាជ័យជំនះលើរបបប្រល័យពូជសាសន៌ / Victory Day Over The Genocidal Regime','','',''
  ),
  (
    4,'21','22','23','24','25','26','27'
    ,'១ រោច ខែបុស្ស','២ រោច','៣ រោច','៤ រោច','៥​ រោច','៦ រោច','៧​ រោច'
    ,'','','','','','',''
    ,'','','','','','',''
    ,'','','','','','',''
    ,'មករា','01','២០១៩','2019','ច','២៥៦២','០១- ចូលឆ្នាំសកល / International News Year Day','០៧- ទិវាជ័យជំនះលើរបបប្រល័យពូជសាសន៌ / Victory Day Over The Genocidal Regime','','',''
  ),
  (
    5,'28','29','30','31','','',''
    ,'៨ រោច ថ្ងៃសិល','៩ រោច','១០ រោច','១១ រោច','','',''
    ,'url','','','','','',''
    ,'','','','','','',''
    ,'','','','','','','ទិវាជាតិសុខភាពមាត់ធ្មេញ'
    ,'មករា','01','២០១៩','2019','ច','២៥៦២','០១- ចូលឆ្នាំសកល / International News Year Day','០៧- ទិវាជ័យជំនះលើរបបប្រល័យពូជសាសន៌ / Victory Day Over The Genocidal Regime','','',''
  ),
  /*02 Feb*/
  (
    6,'','','','','1','2','3'
    ,'','','','','១២ រោច ខែបុស្ស','១៣ រោច','១៤ រោច ថ្ងៃកោរ'
    ,'','','','','','',''
    ,'','','','','','',''
    ,'','','','','','',''
    ,'កុម្ភៈ','02','២០១៩','2019','ច','២៥៦២','១៩- ពីធីបុណ្យមាឃបូជា / MeakBochea Day','','','',''
  ),
  (
    7,'4','5','6','7','8','9','10'
    ,'១៥ រោច','១ កើត','២ កើត','៣ កើត','៤ កើត','៥ កើត','៦ កើត'
    ,'url','','','','','',''
    ,'ដាច់ខែបុស្ស','ខែមាឃ ចូលឆ្នាំចិនឆ្នាំកុរ','','','','',''
    ,'','','','','','',''
    ,'កុម្ភៈ','02','២០១៩','2019','ច','២៥៦២','១៩- ពីធីបុណ្យមាឃបូជា / MeakBochea Day','','','',''
  ),
  (
    8,'11','12','13','14','15','16','17'
    ,'៧ កើត','៨ កើត','៩ កើត','១០ កើត','១១ កើត','១២ កើត','១៣ កើត'
    ,'','url','','','','',''
    ,'','','','','','',''
    ,'','','','','','',''
    ,'កុម្ភៈ','02','២០១៩','2019','ច','២៥៦២','១៩- ពីធីបុណ្យមាឃបូជា / MeakBochea Day','','','',''
  ),
  (
    9,'18','19','20','21','22','23','24'
    ,'១៤ កើត ថ្ងៃកោរ','១៥ កើត មាឃបូជា','១ រោច','២ រោច','៣ រោច','៤ រោច','៥ រោច'
    ,'','url','','','','',''
    ,'','ហែរអ្នកតាចិន','','ទិវាសុខភាពមាតានិងទារក','','','ទិវាសកម្មភាពកំចាត់មីន'
    ,'','','','','','',''
    ,'កុម្ភៈ','02','២០១៩','2019','ច','២៥៦២','១៩- ពីធីបុណ្យមាឃបូជា / MeakBochea Day','','','',''
  ),
  (
    10,'25','26','27','28','','',''
    ,'៦ រោច','៧ រោច','៨ រោច','៩ រោច','','',''
    ,'','','url','','','',''
    ,'','ហែរអ្នកតាចិន','','ទិវាសុខភាពមាតានិងទារក','','','ទិវាសកម្មភាពកំចាត់មីន'
    ,'','','','','','',''
    ,'កុម្ភៈ','02','២០១៩','2019','ច','២៥៦២','១៩- ពីធីបុណ្យមាឃបូជា / MeakBochea Day','','','',''
  )
  /*03 March*/
  (
    11, '', '', '', '', '1', '2', '3'
    , '', '', '', '', '១០ រោច ខែមាឃ', '១១ រោច', '១២ រោច'
    , '', '', '', '', '', '', ''
    , '', '', '', '', '', '', 'ទិវាវប្បធម៌'
    , '', '', '', '', '', '', ''
    , 'មិនា', '03', '២០១៩', '2019', 'ច', '២៥៦២', '១៨- ទិវាអន្តរជាតិនារី / International Women’s Day', '', '', '', ''
  ),
  (
    12,'4','5','6','7','8','9','10'
    ,'១៣ រោច','១៤ រោច','១ កើត','២ កើត','៣ កើត','៤ កើត','៥ កើត'
    ,'','','','','','',''
    ,'ទិវានយោបាយទឹក','ដាច់ ខែមាឃ','គោរពវិញ្ញាណក្ឌ័ន្ធសម្តេចព្រះ','សុរាម្រឹក ព្រះមហាកាព្ធានកោដិ','ទិវានារីអន្តរជាតិ','',''
    ,'','','','','','',''
    ,'មិនា','03','២០១៩','2019','ច','២៥៦២','១៨- ទិវានារីអន្តរជាតិ / International Women’s Day','','','',''
  ),
  (
    13,'11','12','13','14','15','16','17'
    ,'៦ កើត','៧ កើត','៨ កើត','៩ កើត','១០ កើត','១១ កើត','១២ កើត'
    ,'','','url','','','',''
    ,'','','','','','',''
    ,'','','','','','',''
    ,'មិនា','03','២០១៩','2019','ច','២៥៦២','១៨- ទិវានារីអន្តរជាតិ / International Women’s Day','','','',''
  ),
  (
    14,'18','19','20','21','22','23','24'
    ,'១៣ កើត','១៤ កើតថ្ងៃកោរ','១៥ កើត ពេញបុណ៏មី','១ រោច ខែផល្គុន','២ រោច','៣ រោច','៤ រោច'
    ,'','','url','','','',''
    ,'','','','','ទិវាពិ.ភ.ល.ទឹកនិងឧតុនិយម','','ទិវាកំចាត់ជំងឺរបែង'
    ,'','','','','','',''
    ,'មិនា','03','២០១៩','2019','ច','២៥៦២','១៨- ទិវានារីអន្តរជាតិ / International Women’s Day','','','',''
  ),
  (
    15,'25','26','27','28','29','30','31'
    ,'៥ រោច','៦ រោច','៧ រោច','៨ រោច','៩ រោច','១០ រោច','១១ រោច ខែផល្គុន'
    ,'','','','url','','',''
    ,'','','','','ទិវាពិ.ភ.ល.ទឹកនិងឧតុនិយម','','ទិវាកំចាត់ជំងឺរបែង'
    ,'','','','','','',''
    ,'មិនា','03','២០១៩','2019','ច','២៥៦២','១៨- ទិវានារីអន្តរជាតិ / International Women’s Day','','','',''
  ),
  /*04 April*/
  (
    16, '1', '2', '3', '4', '5', '6', '7'
    , '១២ រោច ខែផល្គុន', '១៣ រោច', '១៤ រោច', '១៥ រោច ខែដាច់', '១ កើត', '២ កើត ខែចេត្រ', '៣ កើត'
    , '', '', '', 'url', '', '', ''
    , '', 'តាំងពិធីត្រស្តិសង្រ្គាន', '', 'ព្រះរាជពិធីត្រស្តិនសង្រ្គាន', '', '', 'ទិវាសុខភាពពិភពលោក'
    , '', '', '', '', '', '', ''
    , 'មេសា', '04', '២០១៩', '2019', 'ច', '២៥៦២', '១៤-១៥-១៦ ចូលឆ្នាំប្រពៃណីខ្មែរ / Happy Khmer New Year', '', '', '', ''
  ),
  (
    17, '8', '9', '10', '11', '12', '13', '14'
    , '៤ កើត', '៥ កើត', '៦ កើត', '៧ កើត', '៨ កើត', '៩ កើត', '១០ កើត'
    , '', '', '', '', 'url', '', ''
    , 'ទិវាព្រះពុទ្ធសាសនាពិភពលោក', 'គោរពវិញ្ញាណក្ខ័ន្', '', '', '', '', 'ចូលឆ្នាំកុរ ឯកស័ក'
    , '', 'ព្រះមហាក្សត្រីយ៉ានី', '', '', '', '', 'ម៉ោង១៥ និង ១២ នាទី'
    , 'មេសា', '04', '២០១៩', '2019', 'ច', '២៥៦២', '១៤-១៥-១៦ ចូលឆ្នាំប្រពៃណីខ្មែរ / Happy Khmer New Year', '', '', '', ''
  ),
  (
    18, '15', '16', '17', '18', '19', '20', '21'
    , '១១ កើត', '១២ កើត', '១៣ កើត', '១៤ កើត ថ្ងៃកោរ', '១៥ កើត ពេញបូរណ័មី', '១ រោច ខែចេត្រ', '២ រោច'
    , '', '', '', '', 'url', '', ''
    , 'វរៈវ័នបត', 'វារៈឡើងស័ក', '', '', '', '', 'ចូលឆ្នាំកុរ ឯកស័ក'
    , '', 'ម៉ោង១៩ និង ១២ នាទី', '', '', '', '', ''
    , 'មេសា', '04', '២០១៩', '2019', 'ច', '២៥៦២', '១៤-១៥-១៦ ចូលឆ្នាំប្រពៃណីខ្មែរ / Happy Khmer New Year', '', '', '', ''
  ),
  (
    19, '22', '23', '24', '25', '26', '27', '28'
    , '៣ រោច', '៤ រោច', '៥ រោច', '៦ រោច', '៧ រោច', '៨ រោច', '៩ រោច'
    , '', '', '', '', '', 'url', ''
    , '', '', '', '', '', '', ''
    , '', '', '', '', '', '', ''
    , 'មេសា', '04', '២០១៩', '2019', 'ច', '២៥៦២', '១៤-១៥-១៦ ចូលឆ្នាំប្រពៃណីខ្មែរ / Happy Khmer New Year', '', '', '', ''
  ),
  (
    20, '29', '30', '', '', '', '', ''
    , '១០ រោច', '១១ រោច', '', '', '', '', ''
    , '', '', '', '', '', 'url', ''
    , '', '', '', '', '', '', ''
    , '', 'កម្ពុជាចូលជាសមាជិកអាស៊ាន', '', '', '', '', ''
    , 'មេសា', '04', '២០១៩', '2019', 'ច', '២៥៦២', '១៤-១៥-១៦ ចូលឆ្នាំប្រពៃណីខ្មែរ / Happy Khmer New Year', '', '', '', ''
),
(
    /*05 May*/
    21,'','','1','2','3','4','5'
    ,'','','១២ រោច','១៣ រោច','១៤ រោច','១ កើតខែពិសាខ','២ កើត'
    ,'','','','','url','',''
    ,'','','','','','',''
    ,'','','ទិវាពលកម្មអត្តរជាតិ','ខែជេស្ឋ ថ្ងៃកោរ','ទិវាសេរីភាពសារព័ត៌មាន','',''
    ,'ឧសភា','05','២០១៩','2019','កុរ','២៥៦២','១- ទិវាពលកម្មអត្តរជាតិ / International Labor Day','១៣-១៤-១៥- ​ព្រះរាជពិធីចម្រើនព្រះជន្ម ព្រះមហាក្សត្រ នរោត្តម សីហមុនី / King’s Birthday, Norodom Sihamoni','១៨- ពិធីបុណ្យវិសាខបូជា/Visak Bochea Day','20 ទិវាជាតិនៃការចងចាំ /National Day of Remember','២២ ព្រះរាជពិធីច្រត់ព្រះនង្គ័ល/Royal Plowing Ceremony'
  ),
  ( 22,'6','7','8','9','10','11','12'
    ,'៣ កើត','៤ កើត','៥ កើត','៦ កើត','៧ កើត','៨ កើត','៩ កើត'
    ,'','','','','','url',''
    ,'','','','','','',''
    ,'','','ទិវាកាកបាទក្រហមកម្ពុជា','','','',''
    ,'ឧសភា','05','២០១៩','2019','កុរ','២៥៦២','១- ទិវាពលកម្មអត្តរជាតិ / International Labor Day','១៣-១៤-១៥- ​ព្រះរាជពិធីចម្រើនព្រះជន្ម ព្រះមហាក្សត្រ នរោត្តម សីហមុនី / King’s Birthday, Norodom Sihamoni','១៨- ពិធីបុណ្យវិសាខបូជា/Visak Bochea Day','20 ទិវាជាតិនៃការចងចាំ /National Day of Remember','២២ ព្រះរាជពិធីច្រត់ព្រះនង្គ័ល/Royal Plowing Ceremony'
  )
  ,
  ( 23,'13','14','15','16','17','18','19'
    ,'១០ កើត','១១ កើត','១២ កើត','១៣ កើត','១៤ កើតថ្ងៃកោរ','១៥ កើត វិសាកបូជា','១ រោច'
    ,'','','','','','url',''
    ,'ព្រះមហាក្សត្រ នរោត្តម សីហមុនី','ព្រះមហាក្សត្រ នរោត្តម សីហមុនី','ព្រះមហាក្សត្រ នរោត្តម សីហមុនី','','','',''
    ,'ព្រះរាជពិធីចម្រើនព្រះជន្','ព្រះរាជពិធីចម្រើនព្រះជន្','ព្រះរាជពិធីចម្រើនព្រះជន្','កំណើតនគរបាលជាតិ','','','ចូលពុទ្ធសករាជ ២៥៦៣'
    ,'ឧសភា','05','២០១៩','2019','កុរ','២៥៦២','១- ទិវាពលកម្មអត្តរជាតិ / International Labor Day','១៣-១៤-១៥- ​ព្រះរាជពិធីចម្រើនព្រះជន្ម ព្រះមហាក្សត្រ នរោត្តម សីហមុនី / King’s Birthday, Norodom Sihamoni','១៨- ពិធីបុណ្យវិសាខបូជា/Visak Bochea Day','20 ទិវាជាតិនៃការចងចាំ /National Day of Remember','២២ ព្រះរាជពិធីច្រត់ព្រះនង្គ័ល/Royal Plowing Ceremony'
  ),
  ( 24,'20','21','22','23','24','25','26'
    ,'២ រោច','៣ រោច ខែពិសាខ','៤ រោច','៥ រោច','៦ រោច','៧ រោច','៨ រោច'
    ,'','','','','','','url'
    ,'','','','','','',''
    ,'ទិវាជាតិនៃការចងចាំ','','ព្រះរាជពិធីច្រត់ព្រះនង្គ័ល','','','',''
    ,'ឧសភា','05','២០១៩','2019','កុរ','២៥៦២','១- ទិវាពលកម្មអត្តរជាតិ / International Labor Day','១៣-១៤-១៥- ​ព្រះរាជពិធីចម្រើនព្រះជន្ម ព្រះមហាក្សត្រ នរោត្តម សីហមុនី / King’s Birthday, Norodom Sihamoni','១៨- ពិធីបុណ្យវិសាខបូជា/Visak Bochea Day','20 ទិវាជាតិនៃការចងចាំ /National Day of Remember','២២ ព្រះរាជពិធីច្រត់ព្រះនង្គ័ល/Royal Plowing Ceremony'
  ),
  ( 25,'27','28','29','30','31','',''
    ,'៩ រោច','១០ រោច','១១ រោច','១២ រោច ខែពិសាខ','១៣ រោច','',''
    ,'','','','','','',''
    ,'','','','','','',''
    ,'','','','','ទិវាពិភពលោកគ្មានថ្នាំជក់','',''
    ,'ឧសភា','05','២០១៩','2019','កុរ','២៥៦២','១- ទិវាពលកម្មអត្តរជាតិ / International Labor Day','១៣-១៤-១៥- ​ព្រះរាជពិធីចម្រើនព្រះជន្ម ព្រះមហាក្សត្រ នរោត្តម សីហមុនី / King’s Birthday, Norodom Sihamoni','១៨- ពិធីបុណ្យវិសាខបូជា/Visak Bochea Day','20 ទិវាជាតិនៃការចងចាំ /National Day of Remember','២២ ព្រះរាជពិធីច្រត់ព្រះនង្គ័ល/Royal Plowing Ceremony'
  ),
   /*06 June*/
  (26,'','','','','','1','2'
    ,'','','','','','១៤ រោច','១៥ រោច'
    ,'','','','','','','url'
    ,'','','','','','',''
    ,'','','','','','ទិវាកុមារអត្តរជាតិ','ដាច់ខែពិសាខ'
    ,'មិថុនា','06','២០១៩','2019','កុរ','២៥៦២','១- ទិវាកុមារអត្តរជាតិ / International Children’s Day','១៨ ​ព្រះរាជពិធីចម្រើនព្រះជន្ម ព្រះវរៈរាជមាតា នរោត្តមមុនិនាថ សីហនុ / King’s Mother Birthday, Norodom Monineath Sihanouk','','',''
  ),
  (27,'3','4','5','6','7','8','9'
    ,'២ កើត ខែជេស្ឋ','៣ កើត','៤ កើត','៥ កើត','៦ កើត','៧ កើត','៨ កើត'
    ,'','','','','','',''
    ,'','','','','','',''
    ,'','','ទិវាបរិស្ថានជាតិ និងអន្តរជាតិ','','សែននំចាំង','',''
    ,'មិថុនា','06','២០១៩','2019','កុរ','២៥៦២','១- ទិវាកុមារអត្តរជាតិ / International Children’s Day','១៨ ​ព្រះរាជពិធីចម្រើនព្រះជន្ម ព្រះវរៈរាជមាតា នរោត្តមមុនិនាថ សីហនុ / King’s Mother Birthday, Norodom Monineath Sihanouk','','',''
  ),
  (28,'10','11','12','13','14','15','16'
    ,'៨ កើត ខែជេស្ឋ','៩ កើត','១០ កើត','១១ កើត','១២ កើត','១៣ កើត','១៤ កើត'
    ,'url','','','','','',''
    ,'','','','','','ព្រះវិហារឲ្យមកកម្ពុជាវិញ',''
    ,'','','ទិវាប្រឆាំងនិងពលកម្មកុមារ','','','ក្រុងឡាអេប្រគល់ប្រាសាទ','ព្រះវិហារឲ្យមកកម្ពុជា'
    ,'មិថុនា','06','២០១៩','2019','កុរ','២៥៦២','១- ទិវាកុមារអត្តរជាតិ / International Children’s Day','១៨ ​ព្រះរាជពិធីចម្រើនព្រះជន្ម ព្រះវរៈរាជមាតា នរោត្តមមុនិនាថ សីហនុ / King’s Mother Birthday, Norodom Monineath Sihanouk','','',''
  ),
  (29,'17','18','19','20','21','22','23'
    ,'១៥ កើត ពេញបូណ៌មី','១ រោច','២ រោច','៣ រោច ខែជេស្ឋ','៤ រោច','៥ រោច','៦ រោច'
    ,'url','','','','','',''
    ,'','ព្រះវរោជមាតា នរោត្តមមុនិនាថ សីហនុ','','','','',''
    ,'','ព្រះរាជពិធីចម្រើនព្រះជន្','','','ទិវាអតីតយុវជន','',''
    ,'មិថុនា','06','២០១៩','2019','កុរ','២៥៦២','១- ទិវាកុមារអត្តរជាតិ / International Children’s Day','១៨ ​ព្រះរាជពិធីចម្រើនព្រះជន្ម ព្រះវរៈរាជមាតា នរោត្តមមុនិនាថ សីហនុ / King’s Mother Birthday, Norodom Monineath Sihanouk','','',''
  ),
  (30,'24','25','26','27','28','29','30'
    ,'៧ រោច','៨ រោច','៩ រោច','១០ រោច ខែជេស្ឋ','១១ រោច','១២ រោច','១៣ រោច ថ្ងៃកោរ'
    ,'','url','','','','',''
    ,'','','','','','',''
    ,'','','ទិវាប្រឆាំងគ្រឿងញៀន','','កំណើតគណប្សប្រជាជន','',''
    ,'មិថុនា','06','២០១៩','2019','កុរ','២៥៦២','១- ទិវាកុមារអត្តរជាតិ / International Children’s Day','១៨ ​ព្រះរាជពិធីចម្រើនព្រះជន្ម ព្រះវរៈរាជមាតា នរោត្តមមុនិនាថ សីហនុ / King’s Mother Birthday, Norodom Monineath Sihanouk','','',''
  ), /*07 July*/
  (31,'1','2','3','4','5','6','7'
    ,'១៤ រោច','១ កើតអាសាឍ','២ កើត','៣ កើត','៤ កើត','៥ កើត','៦ កើត'
    ,'url','','','','','',''
    ,'','','','','','','បេតិភណ្ឌពិភពលោក'
    ,'ទិវាមច្ឆជាតិ ដាច់ខែជេស្ឋ','','','','','','ប្រាសាទព្រះវិហារចូលជាសម្បត្'
    ,'កក្កដា','07','២០១៩','2019','កុរ','២៥៦២','','','','',''
  ),
  (32,'8','9','10','11','12','13','14'
    ,'៧ កើត','៨ កើត','៩ កើត','១០ កើត','១១ កើត','១២ កើត','១៣ កើត'
    ,'','url','','','','',''
    ,'','','','','','',''
    ,' ','','','','','',''
    ,'កក្កដា','07','២០១៩','2019','កុរ','២៥៦២','','','','',''
  ),
  (33,'15','16','17','18','19','20','21'
    ,'១៤ កើត ថ្ងៃកោរ','១៥ កើត ពេញបូណ៌មី','១ រោច ខែអាសាឍ','២ រោច','៣ រោច','៤ រោច','៥ រោច'
    ,'','url','','','','',''
    ,'','','','','','',''
    ,' ','','','','','',''
    ,'កក្កដា','07','២០១៩','2019','កុរ','២៥៦២','','','','',''
  ),
  (34,'22','23','24','25','26','27','28'
    ,'៦ រោច','៧ រោច','៨ រោច','៩ រោច','១០ រោច','១១ រោច','១២ រោច'
    ,'','','url','','','',''
    ,'','','','','','',''
    ,' ','','','','','',''
    ,'កក្កដា','07','២០១៩','2019','កុរ','២៥៦២','','','','',''
  ),
  (35,'29','30','31','','','',''
    ,'១៣ រោច','១៤ រោច','១៥ រោច','','','',''
    ,'','','url','','','',''
    ,'','','','','','',''
    ,'','','គុកទួលស្លែងចូលចូណេស្កូ','','','',''
    ,'កក្កដា','07','២០១៩','2019','កុរ','២៥៦២','','','','',''
  ),  /*08 August*/
  (36,'','','','1','2','3','4'
    ,'','','','១ កើត ខែស្រាពណ៌','២ កើត','៣ កើត','៤ កើត'
    ,'','','','','','',''
    ,'','','','','','',''
    ,'','','','','','',''
    ,'សីហា','08','២០១៩','2019','កុរ','២៥៦២','','','','',''
  ),
  (36,'5','6','7','8','9','10','11'
    ,'៥ កើត','៦ កើត','៧ កើត','៨ កើត','៩ កើត','១០ កើត','១១ កើត'
    ,'','','','url','','',''
    ,'','','','','','',''
    ,'','','','','','',''
    ,'សីហា','08','២០១៩','2019','កុរ','២៥៦២','','','','',''
  ),
  (37,'12','13','14','15','16','17','18'
    ,'១២ កើត','១៣ កើត','១៤ កើត','១៥ កើត','១ រោចស្រាពណ៌','២ រោច','៣ រោច'
    ,'','','','url','','',''
    ,'','','','','','',''
    ,'','','','','ពេញបូណ៌មី សែនក្បាលទឹក','',''
    ,'សីហា','08','២០១៩','2019','កុរ','២៥៦២','','','','',''
  ),
  (38,'19','20','21','22','23','24','25'
    ,'៤ រោច','៥ រោច','៦ រោច','៧ រោច','៨ រោច','៩ រោច','១០ រោច'
    ,'','','','','url','',''
    ,'','','','','','',''
    ,'','','','','','',''
    ,'សីហា','08','២០១៩','2019','កុរ','២៥៦២','','','','',''
  ),
  (39,'26','27','28','29','30','31',''
    ,'១១ រោច','១២ រោច','១៣ រោច ខែកោរ','១៤ រោចដាច់ខែស្រាពណ៌','១ កើតខែភទ្របទ','២ កើត',''
    ,'','','','url','','',''
    ,'','','','','','',''
    ,'','','','','','',''
    ,'សីហា','08','២០១៩','2019','កុរ','២៥៦២','','','','',''
  )
;

SELECT *FROM td_month_master;

DELETE FROM td_month_master WHERE id = 1;

INSERT INTO td_data_month_master(id,monday_solar_num,tuesday_solar_num,wednesday_solar_num,thursday_midpright_co,friday_solar_num,saturday_solar_num,sunday_solar_num
,monday_midpright_co,tuesday_midpright_co,wednesday_midpright_co,thursday_midpright_co,friday_midpright_co,saturday_midpright_co,sunday_midpright_co
,monday_top_url,tuesday_top_url,wednesday_top_url,thursday_top_url,friday_top_url,saturday_top_url,sunday_top_url
,monday_topright_co,tuesday_topright_co,wednesday_topright_co,thursday_topright_co,friday_topright_co,saturday_topright_co,sunday_topright_co
,monday_underpright_co,tuesday_underpright_co,wednesday_underpright_co,thursday_underpright_co,friday_underpright_co,saturday_underpright_co,sunday_underpright_co
,month,num_month,year,year_en,year_lunar,year_buddha_era
) VALUES (1,'','1','2','3','4','5','6'
,'','10 រោច','១១ រោចខែមិគសិរ','១២ រោច','១៣ រោច ថ្ងៃកោរ','១៤ រោចខែដាច់','១ កើត ខែបុស្ស'
,'','','','','','url',''
,'','','','','','',''
,'','ចូលឆ្នាំសកល','','','','',''
,'មករា','01','២០១៩','2019','ច','២៥៦២'
)
;